In [1]:
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from datetime import datetime
from sklearn.metrics import mean_squared_error
from math import sqrt
import chart_studio.plotly as py
#import chart_studio.graph_objs as go
import plotly.io as pio
from plotly.offline import init_notebook_mode, iplot

In [2]:
bt_contestants = pd.read_csv('bachelorette-contestants.csv')
bt_contestants.head()

,Name,Age,Occupation,Hometown,ElimWeek,Season
0,Ryan Sutter,29,Firefighter,"Vail, Colorado",NaN,1
1,Charlie Maher,28,Financial Analyst,"Hermosa Beach, California",6.0,1
2,Russ,30,Writer,"San Rafael, California",5.0,1
3,Greg T.,28,Importer,"Manhattan, New York",4.0,1
4,Bob Guiney,31,Mortgage Broker,"Ferndale, Michigan",3.0,1

In [3]:
bt_df = pd.read_csv('bachelorettes.csv')
bt_df.head()

,Name,Age,Occupation,Hometown,Season
0,Trista Rehn,30.0,Physical therapist,"Indianapolis, Indiana",1
1,Meredith Phillips,NaN,Makeup artist,NaN,2
2,"Jennifer ""Jen"" Schefft",NaN,Publicist,NaN,3
3,DeAnna Pappas,NaN,Real estate agent,NaN,4
4,Jillian Harris,29.0,Interior designer,"Vancouver, British Columbia, Canada",5

In [4]:
# merge bachelorette df and contestants
df_all_bt = bt_contestants.merge(bt_df, on='Season', suffixes=('Contestant', 'Bachelorette'))

In [5]:
df_all_bt.head()

,NameContestant,AgeContestant,OccupationContestant,HometownContestant,ElimWeek,Season,NameBachelorette,AgeBachelorette,OccupationBachelorette,HometownBachelorette
0,Ryan Sutter,29,Firefighter,"Vail, Colorado",NaN,1,Trista Rehn,30.0,Physical therapist,"Indianapolis, Indiana"
1,Charlie Maher,28,Financial Analyst,"Hermosa Beach, California",6.0,1,Trista Rehn,30.0,Physical therapist,"Indianapolis, Indiana"
2,Russ,30,Writer,"San Rafael, California",5.0,1,Trista Rehn,30.0,Physical therapist,"Indianapolis, Indiana"
3,Greg T.,28,Importer,"Manhattan, New York",4.0,1,Trista Rehn,30.0,Physical therapist,"Indianapolis, Indiana"
4,Bob Guiney,31,Mortgage Broker,"Ferndale, Michigan",3.0,1,Trista Rehn,30.0,Physical therapist,"Indianapolis, Indiana"

In [6]:
ba_contestants = pd.read_csv('bachelor-contestants.csv')
ba_contestants.head()

,Name,Age,Occupation,Hometown,Height,ElimWeek,Season
0,Amanda Marsh,23.0,Event Planner,"Chanute, Kansas",NaN,NaN,1
1,Trista Rehn,29.0,Miami Heat Dancer,"Miami, Florida",NaN,6.0,1
2,Shannon Oliver,24.0,Financial Management Consultant,"Dallas, Texas",NaN,5.0,1
3,Kim,24.0,Nanny,"Tempe, Arizona",NaN,4.0,1
4,Cathy Grimes,22.0,Graduate Student,"Terra Haute, Indiana",NaN,3.0,1

In [7]:
ba_df = pd.read_csv('bachelors.csv')
ba_df.head()

               Name  Age                   Hometown  Height  Season
0       Alex Michel   32  Charlottesville, Virginia     NaN       1
1      Aaron Buerge   28           Butler, Missouri     NaN       2
2      Jesse Palmer   34           Toronto, Ontario     NaN       5
3  Lorenzo Borghese   34               Milan, Italy     NaN       9
4      Andy Baldwin   30    Lancaster, Pennsylvania     NaN      10

In [8]:
# merge bachelor df and contestants
df_all_ba = ba_contestants.merge(ba_df, on='Season', suffixes=('Contestant', 'Bachelore'))
df_all_ba.head()

,NameContestant,AgeContestant,Occupation,HometownContestant,HeightContestant,ElimWeek,Season,NameBachelore,AgeBachelore,HometownBachelore,HeightBachelore
0,Amanda Marsh,23.0,Event Planner,"Chanute, Kansas",NaN,NaN,1,Alex Michel,32,"Charlottesville, Virginia",NaN
1,Trista Rehn,29.0,Miami Heat Dancer,"Miami, Florida",NaN,6.0,1,Alex Michel,32,"Charlottesville, Virginia",NaN
2,Shannon Oliver,24.0,Financial Management Consultant,"Dallas, Texas",NaN,5.0,1,Alex Michel,32,"Charlottesville, Virginia",NaN
3,Kim,24.0,Nanny,"Tempe, Arizona",NaN,4.0,1,Alex Michel,32,"Charlottesville, Virginia",NaN
4,Cathy Grimes,22.0,Graduate Student,"Terra Haute, Indiana",NaN,3.0,1,Alex Michel,32,"Charlottesville, Virginia",NaN

In [9]:
bachelorette.info()

NameError: name 'bachelorette' is not defined

In [ ]:
def get_state(x):
    ''' 
    Extracts the state from the hometown column. 
    Isnt fully effective since there are other countries and abbreviations.
    '''
    if type(x)==str:
        try:
            return x.split(',')[1].strip()
        except IndexError:
            print(x)

ba_df['state'] = ba_df.Hometown.map(get_state)
print('bachelor complete...')
bt_df['state'] = bt_df.Hometown.map(get_state)
print('bachelorette complete...')

In [ ]:
bt_df.head()

In [ ]:
def state_sums(df, plot=False):
    '''Returns sorted series tallying number of contestants from a state'''
    # create dummies to sum
    state_counts = pd.get_dummies(df.state)
    state_sums = state_counts.sum(axis=0).sort_values()
    if plot:
        plt.figure(figsize=(15,10))
        sns.barplot(x=state_sums.index, y=state_sums)
        plt.xticks(rotation='vertical')
    return state_sums

In [ ]:
bachelor_state_sums = state_sums(ba_df, plot=True)

In [ ]:
print('Mean bachelor constestant age: ',ba_df.Age.mean())
print('Mean bachelorette constestant age: ',bt_df.Age.mean())

In [ ]:
bt_df.head()

In [ ]:
bt_df[bt_df['state'] == '']['Hometown']

In [ ]:
perstate = bt_df[bt_df['state'] != '']['state'].value_counts().to_dict()

data = [dict(
        type = 'choropleth',
        autocolorscale = False,
        colorscale = 'Blues',
        reversescale = True,
        locations = list(perstate.keys()),
        locationmode = 'USA-states',
        text = list(perstate.values()),
        z = list(perstate.values()),
        marker = dict(
            line = dict(
                color = 'rgb(255, 255, 255)',
                width = 2)
            ),
        )]

layout = dict(
         title = 'Bachelorette contestants by State',
         geo = dict(
             scope = 'usa',
             projection = dict(type = 'albers usa'),
             countrycolor = 'rgb(255, 255, 255)',
             showlakes = True,
             lakecolor = 'rgb(255, 255, 255)')
         )

figure = dict(data = data, layout = layout)
iplot(figure)

In [ ]:
list(perstate.keys())

In [ ]:
list(perstate.values())

In [ ]:
# find fraction of rose ceremonies passed for each contestant

weeks_in_season = dict(bt_contestants.groupby('Season')['ElimWeek'].aggregate(np.max))

def progress(a, b):
    if np.isnan(a):
        return 1
    else:
        return (a-1) / weeks_in_season[b]
    
bt_contestants['Progress'] = bt_contestants[['ElimWeek', 'Season']].apply(
    lambda x: progress(x[0], x[1]), axis=1)

In [ ]:
bt_contestants.head()

In [ ]:
# age differences between contestants and bachelorettes

bt_contestants['AgeDifference'] = df_all_bt['AgeContestant'] - df_all_bt['AgeBachelorette']

In [ ]:
bt_contestants.head()

In [ ]:
bt_contestants.plot(kind='scatter', marker='x', x='Progress', y='AgeDifference')

In [ ]:
bt_contestants.isnull().sum()